export default {
    name: 'Home',
    data() {
        return {
            roleList: [
                {
                    "title": "天元之弈",
                    "name": "弈星",
                    "profession": "法师",
                    "photo": "http://game.gtimg.cn/images/yxzj/img201606/heroimg/197/197.jpg",
                    "banner": "http://game.gtimg.cn/images/yxzj/img201606/skin/hero-info/197/197-bigskin-1.jpg",
                    "skill": [
                        {
                            "name": "气合&nbsp;&nbsp;&nbsp;&nbsp;冷却值：90&nbsp;&nbsp;消耗：0",
                            "img": "http://game.gtimg.cn/images/yxzj/img201606/heroimg/197/19700.png",
                            "describe1": "在指定地点放置一颗黑色棋子，棋子生成时会对周围敌人造成200/240/280/320/360/400（+25%法术加成）点法术伤害。黑白棋子如果距离低于1000，则会互相吸引并爆炸，对范围内的敌人造成400（+50%法术加成）点法术伤害和90%减速持续1秒(爆炸伤害随英雄等级成长,2秒内连续受到爆炸后续伤害将衰减50%)。棋子每8秒存储一发（受到减CD属性影响），最多存储4颗，每颗棋子最多持续15秒。",
                            "describe2":"可以先放置多颗同色棋子，再根据实际情况使用另一色棋子引动爆炸"
                        },
                        {
                            "name": "气合&nbsp;&nbsp;&nbsp;&nbsp;冷却值：90&nbsp;&nbsp;消耗：0",
                            "img": "http://game.gtimg.cn/images/yxzj/img201606/heroimg/197/19710.png",
                            "describe1": "被动：血量低于35%时，弈星会遁入虚无，免疫所有伤害并提升30%移动速度，持续2秒，并在旁边自动生成两颗棋子，这个效果有90秒CD。弈星的普通攻击会造成70（+100%物理加成）（+20%法术加成）点法术伤害。",
                            "describe2":"凭借被动，弈星很难被刺客一击击杀，但是单人行动时，被动并不能让弈星摆脱危险情况"
                        },
                        {
                            "name": "定式·倚盖&nbsp;&nbsp;&nbsp;&nbsp;冷却值：1&nbsp;&nbsp;消耗：35",
                            "img": "http://game.gtimg.cn/images/yxzj/img201606/heroimg/197/19720.png",
                            "describe1": "在指定地点放置一颗白色棋子，棋子生成时会对周围敌人造成200/240/280/320/360/400（+25%法术加成）点法术伤害。黑白棋子如果距离低于1000，则会互相吸引并爆炸，对范围内的敌人造成400（+50%法术加成）点法术伤害和90%减速持续1秒(爆炸伤害随英雄等级成长,2秒内连续受到爆炸后续伤害将衰减50%)。棋子每8秒存储一发（受到减CD属性影响），最多存储4颗，每颗棋子最多持续15秒。",
                            "describe2":"根据形势让敌人处于棋子连线的中央可打出高额伤害"
                        },
                        {
                            "name": "天元&nbsp;&nbsp;&nbsp;&nbsp;冷却值：80/75/70&nbsp;&nbsp;消耗：120",
                            "img": "http://game.gtimg.cn/images/yxzj/img201606/heroimg/197/19730.png",
                            "describe1": "弈星划出一个巨大的虚空棋盘，棋盘上会自动生成4颗棋子。释放技能2秒后棋盘完全成型，成型时对棋盘内的敌人造成480/720/960（+72%法术加成）点法术伤害和0.5秒眩晕，棋盘完全成型后所有棋盘上的敌人将无法离开棋盘范围，棋盘成型后共持续4秒。",
                            "describe2":"超大的范围是该技能的优势，但是略微有些长的生成时间，需要配合队友控制才能将敌人完全限制在棋盘之中"
                        }
                    ]
                },
                {
                    "title": "入梦之灵",
                    "name": "梦奇",
                    "profession": "坦克",
                    "photo": "http://game.gtimg.cn/images/yxzj/img201606/heroimg/198/198.jpg",
                    "banner": "http://game.gtimg.cn/images/yxzj/img201606/skin/hero-info/198/198-bigskin-1.jpg",
                    "skill": [
                        {
                            "name": "气合&nbsp;&nbsp;&nbsp;&nbsp;冷却值：90&nbsp;&nbsp;消耗：0",
                            "img": "http://game.gtimg.cn/images/yxzj/img201606/heroimg/198/19800.png",
                            "describe1": "在指定地点放置一颗黑色棋子，棋子生成时会对周围敌人造成200/240/280/320/360/400（+25%法术加成）点法术伤害。黑白棋子如果距离低于1000，则会互相吸引并爆炸，对范围内的敌人造成400（+50%法术加成）点法术伤害和90%减速持续1秒(爆炸伤害随英雄等级成长,2秒内连续受到爆炸后续伤害将衰减50%)。棋子每8秒存储一发（受到减CD属性影响），最多存储4颗，每颗棋子最多持续15秒。",
                            "describe2":"可以先放置多颗同色棋子，再根据实际情况使用另一色棋子引动爆炸"
                        },
                        {
                            "name": "气合&nbsp;&nbsp;&nbsp;&nbsp;冷却值：90&nbsp;&nbsp;消耗：0",
                            "img": "http://game.gtimg.cn/images/yxzj/img201606/heroimg/198/19810.png",
                            "describe1": "被动：血量低于35%时，弈星会遁入虚无，免疫所有伤害并提升30%移动速度，持续2秒，并在旁边自动生成两颗棋子，这个效果有90秒CD。弈星的普通攻击会造成70（+100%物理加成）（+20%法术加成）点法术伤害。",
                            "describe2":"凭借被动，弈星很难被刺客一击击杀，但是单人行动时，被动并不能让弈星摆脱危险情况"
                        },
                        {
                            "name": "定式·倚盖&nbsp;&nbsp;&nbsp;&nbsp;冷却值：1&nbsp;&nbsp;消耗：35",
                            "img": "http://game.gtimg.cn/images/yxzj/img201606/heroimg/198/19820.png",
                            "describe1": "在指定地点放置一颗白色棋子，棋子生成时会对周围敌人造成200/240/280/320/360/400（+25%法术加成）点法术伤害。黑白棋子如果距离低于1000，则会互相吸引并爆炸，对范围内的敌人造成400（+50%法术加成）点法术伤害和90%减速持续1秒(爆炸伤害随英雄等级成长,2秒内连续受到爆炸后续伤害将衰减50%)。棋子每8秒存储一发（受到减CD属性影响），最多存储4颗，每颗棋子最多持续15秒。",
                            "describe2":"根据形势让敌人处于棋子连线的中央可打出高额伤害"
                        },
                        {
                            "name": "天元&nbsp;&nbsp;&nbsp;&nbsp;冷却值：80/75/70&nbsp;&nbsp;消耗：120",
                            "img":
                            "http://game.gtimg.cn/images/yxzj/img201606/heroimg/198/19830.png",
                            "describe1": "弈星划出一个巨大的虚空棋盘，棋盘上会自动生成4颗棋子。释放技能2秒后棋盘完全成型，成型时对棋盘内的敌人造成480/720/960（+72%法术加成）点法术伤害和0.5秒眩晕，棋盘完全成型后所有棋盘上的敌人将无法离开棋盘范围，棋盘成型后共持续4秒。",
                            "describe2":"超大的范围是该技能的优势，但是略微有些长的生成时间，需要配合队友控制才能将敌人完全限制在棋盘之中"
                        }
                    ]
                }
            ]
        }
    },
    methods: {
        
    }
}